tap "homebrew/bundle"

# --- Languages & Runtimes ---
brew "uv"               # Fast Python package manager and resolver
brew "bun"              # Primary JS runtime and package manager
brew "node"             # Required by some tools that don't support bun

# --- Shell & Terminal ---
brew "bat"              # Better cat with syntax highlighting
brew "ripgrep"          # Fast grep replacement
brew "eza"              # Better ls with icons and git status
brew "zoxide"           # Smarter cd that learns your habits
brew "fd"               # Fast and user-friendly find replacement
brew "fzf"              # Fuzzy finder
brew "yazi"             # Terminal file manager
brew "zellij"           # Terminal multiplexer
brew "mprocs"           # Run multiple commands side-by-side
brew "git-delta"        # Better git diff pager
brew "fx"               # Interactive JSON viewer
brew "gron"             # Make JSON greppable
brew "hyperfine"        # Command-line benchmarking tool

# --- Dev Tools ---
brew "ruff"             # Fast Python linter and formatter
brew "jq"               # Command-line JSON processor
brew "gh"               # GitHub CLI
brew "just"             # Command runner (Makefile alternative)
brew "pandoc"           # Universal document converter
brew "neovim"           # Primary editor
brew "biome"            # Fast JS/TS linter and formatter
brew "prettier"         # Opinionated code formatter
brew "pyright"          # Python static type checker
brew "poetry"           # Python dependency management
brew "httpie"           # User-friendly HTTP client
brew "thefuck"          # Correct mistyped commands
brew "yt-dlp"           # Download videos
brew "difftastic"       # Structural diff tool
brew "gum"              # Shell script TUI
brew "scrapy"           # Web scraping framework
brew "poethepoet"       # Python task runner
brew "cloc"             # Count lines of code

# --- CLI Utilities ---
brew "atuin"            # Shell history sync and search
brew "tealdeer"         # Fast tldr pages client
brew "croc"             # Simple file transfer between machines
brew "awscli"           # AWS CLI

# --- Misc ---
brew "vhs"              # Terminal GIF recorder

# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Virtual Audio Driver
cask "blackhole-16ch"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Break time reminder app
cask "stretchly"
# Open-source code editor
cask "visual-studio-code"
# Gecko based web browser
cask "zen-browser"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "bierner.lit-html"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "brenek.kotlin-for-frc"
vscode "charliermarsh.ruff"
vscode "continue.continue"
vscode "crdrost.ktfmt"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "file-icons.file-icons"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "icrawl.discord-vscode"
vscode "ionic.ionic"
vscode "james-yu.latex-workshop"
vscode "josevseb.google-java-format-for-vs-code"
vscode "julialang.language-julia"
vscode "miguelsolorio.symbols"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "pokey.cursorless"
vscode "pokey.parse-tree"
vscode "redhat.java"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "seatonjiang.gitmoji-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
