tap "artginzburg/tap"
tap "cantino/mcfly"
tap "charmbracelet/tap"
tap "eth-p/software"
tap "helix-editor/helix"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "jeffreywildman/virt-manager"
tap "jesseduffield/lazygit"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "minio/stable"
tap "mongodb/brew"
tap "pkgxdev/made"
tap "supabase/tap"
tap "teamookla/speedtest"
tap "thought-machine/please"
# Run your GitHub Actions locally
brew "act"
# Software library to render fonts
brew "freetype"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# General-purpose data compression with high compression ratio
brew "xz"
# Library to render SVG files using Cairo
brew "librsvg"
# Icons for the GNOME project
brew "adwaita-icon-theme"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Arduino command-line interface
brew "arduino-cli"
# Portable Foreign Function Interface library
brew "libffi"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Get/set bluetooth power and discoverable state
brew "blueutil"
# Freely available high-quality data compressor
brew "bzip2"
# Human-friendly and fast alternative to cut and (sometimes) awk
brew "choose-rust"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Securely send things from one computer to another
brew "croc"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# Diff that understands syntax
brew "difftastic"
# Load/unload environment variables based on $PWD
brew "direnv"
# Minimal, fast alternative to 'du -sh'
brew "diskus"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Multi-format archive and compression library
brew "libarchive"
# Cross-platform library for audio I/O
brew "portaudio"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Command-line tools for fly.io services
brew "flyctl"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# Library for encoding and decoding .avif files
brew "libavif"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# GIF image/animation creator/editor
brew "gifsicle"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Blazing fast terminal-ui for git written in rust
brew "gitui"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# GNU Ubiquitous Intelligent Language for Extensions
brew "guile", link: false
# Tool for glamorous shell scripts
brew "gum"
# Post-modern modal text editor
brew "helix"
# Command-line hex viewer
brew "hexyl"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# ID3 tag manipulation
brew "id3lib"
# Convert XML to another format (based on XSL or other tools)
brew "xmlto"
# Database of common MIME types
brew "shared-mime-info"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# C/C++ seam carving library
brew "liblqr"
# LLVM's OpenMP runtime library
brew "libomp", link: true
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Parallel bzip2 utility
brew "lbzip2"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Data compression library
brew "lzlib"
# Mac App Store command-line interface
brew "mas"
# Small build system for use with gyp or CMake
brew "ninja"
# Fast and user friendly build system
brew "meson"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Modern shell for the GitHub era
brew "nushell"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Emulator for x86 and PowerPC
brew "qemu"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Fast and accurate code counter with complexity and COCOMO estimates
brew "scc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Permanent TouchID support for sudo
brew "artginzburg/tap/sudo-touchid"
# McFly
brew "cantino/mcfly/mcfly"
# Quickly search through and highlight files using ripgrep
brew "eth-p/software/bat-extras-batgrep"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# High Performance Object Storage compatible with Amazon S3 API
brew "minio/stable/minio"
# Run Anything
brew "pkgxdev/made/pkgx"
# Supabase CLI
brew "supabase/tap/supabase"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Desktop wrapper for OpenAI ChatGPT
cask "chatgpt", args: { appdir: "~/Applications" }
# Automated testing of webapps for Google Chrome
cask "chromedriver"
# Vector graphics editor
cask "inkscape", args: { appdir: "~/Applications" }
# Control your tools with a few keystrokes
cask "raycast", args: { appdir: "~/Applications" }
# HTML to PDF renderer
cask "wkhtmltopdf"
mas "AdGuard for Safari", id: 1440147259
mas "Aiko", id: 1672085276
mas "GarageBand", id: 682658836
mas "Grammarly for Safari", id: 1462114288
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PathPlanner", id: 1593046876
mas "School", id: 1465687472
mas "Surfshark", id: 1437809329
mas "Userscripts", id: 1463298887
mas "Vimari", id: 1480933944
mas "Xcode", id: 497799835
vscode "alefragnani.Bookmarks"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "bbenoist.Nix"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "charliermarsh.ruff"
vscode "Codeium.codeium"
vscode "cschlosser.doxdocgen"
vscode "dbaeumer.vscode-eslint"
vscode "EditorConfig.EditorConfig"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "icrawl.discord-vscode"
vscode "JakeBecker.elixir-ls"
vscode "jaspernorth.vscode-pigments"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "kiteco.kite"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.vscode-serial-monitor"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "Prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.sonokai"
vscode "seatonjiang.gitmoji-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "TabNine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "tshino.kb-macro"
vscode "twxs.cmake"
vscode "Tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vsciot-vscode.vscode-arduino"
vscode "Vtrois.gitmoji-vscode"
vscode "WakaTime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
vscode "YuTengjing.vscode-archive"
