tap "ariga/tap"
tap "artginzburg/tap"
tap "dotenvx/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jsdelivr/globalping"
tap "libsql/sqld"
tap "osx-cross/avr"
tap "pkgxdev/made"
tap "supabase/tap"
tap "tursodatabase/tap"
tap "withgraphite/tap"
# Library for manipulating PNG images
brew "libpng"
# Software library to render fonts
brew "freetype"
# XML-based font configuration API for X Windows
brew "fontconfig"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Simple, modern, secure file encryption
brew "age"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Atmel AVR MCU programmer
brew "avrdude"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Modern, simple TCP tunnel in Rust that exposes local ports to a remote server
brew "bore-cli"
# Binary installation for rust projects
brew "cargo-binstall"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Securely send things from one computer to another
brew "croc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Fast and statically typed, compiled language with Ruby-like syntax
brew "crystal"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Audio codec
brew "opus"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Duplicate file utility
brew "czkawka"
# Diff that understands syntax
brew "difftastic"
# Modern, maintained replacement for ls
brew "eza"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg@6"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Git extension for versioning large files
brew "git-lfs"
# GNU version of the tar archiving utility
brew "gnu-tar"
# Tool for glamorous shell scripts
brew "gum"
# Command-line hex viewer
brew "hexyl"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image manipulation library
brew "jpeg"
# BSD-style licensed readline alternative
brew "libedit"
# Library to communicate with iOS devices natively
brew "libimobiledevice"
# Fast, highly customisable system info script
brew "neofetch"
# Port scanning utility for large networks
brew "nmap"
# Statically typed programming language for scientific computations
brew "numbat"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Fast, disk space efficient package manager
brew "pnpm"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Instant terminal sharing
brew "tmate"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# A database toolkit
brew "ariga/tap/atlas"
# Permanent TouchID support for sudo
brew "artginzburg/tap/sudo-touchid"
# Better dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
brew "jsdelivr/globalping/globalping"
# GNU Binutils for the AVR target
brew "osx-cross/avr/avr-binutils"
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Supabase CLI
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Virtual Audio Driver
cask "blackhole-16ch"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Break time reminder app
cask "stretchly"
# Open-source code editor
cask "visual-studio-code"
# Gecko based web browser
cask "zen-browser"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "bierner.lit-html"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "brenek.kotlin-for-frc"
vscode "charliermarsh.ruff"
vscode "continue.continue"
vscode "crdrost.ktfmt"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "file-icons.file-icons"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "icrawl.discord-vscode"
vscode "ionic.ionic"
vscode "james-yu.latex-workshop"
vscode "josevseb.google-java-format-for-vs-code"
vscode "julialang.language-julia"
vscode "miguelsolorio.symbols"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "redhat.java"
vscode "runem.lit-plugin"
vscode "rust-lang.rust-analyzer"
vscode "seatonjiang.gitmoji-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
