tap "artginzburg/tap"
tap "dotenvx/brew"
tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jsdelivr/globalping"
tap "libsql/sqld"
tap "supabase/tap"
tap "tursodatabase/tap"
tap "withgraphite/tap"
# Simple, modern, secure file encryption
brew "age"
# General-purpose data compression with high compression ratio
brew "xz"
# Code searching, linting, rewriting
brew "ast-grep"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Binary installation for rust projects
brew "cargo-binstall"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Securely send things from one computer to another
brew "croc"
# Diff that understands syntax
brew "difftastic"
# Modern, maintained replacement for ls
brew "eza"
# Easiest way to build and release mobile apps
brew "fastlane"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Git extension for versioning large files
brew "git-lfs"
# Tool for glamorous shell scripts
brew "gum"
# Command-line hex viewer
brew "hexyl"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Fast, highly customisable system info script
brew "neofetch"
# Statically typed programming language for scientific computations
brew "numbat"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Implementation of Python 3 in Python
brew "pypy3.10"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Source control client
brew "sapling"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Instant terminal sharing
brew "tmate"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Permanent TouchID support for sudo
brew "artginzburg/tap/sudo-touchid"
# Better dotenv–from the creator of `dotenv`
brew "dotenvx/brew/dotenvx"
brew "jsdelivr/globalping/globalping"
# Supabase CLI
brew "supabase/tap/supabase"
brew "tursodatabase/tap/turso"
# Allows you to manage your stacked changes and submit them for review on GitHub
brew "withgraphite/tap/graphite"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Virtual Audio Driver
cask "blackhole-16ch"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Break time reminder app
cask "stretchly"
# Open-source code editor
cask "visual-studio-code"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "azemoh.one-monokai"
vscode "bierner.lit-html"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "brenek.kotlin-for-frc"
vscode "charliermarsh.ruff"
vscode "crdrost.ktfmt"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "file-icons.file-icons"
vscode "fwcd.kotlin"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "gruntfuggly.todo-tree"
vscode "icrawl.discord-vscode"
vscode "ionic.ionic"
vscode "james-yu.latex-workshop"
vscode "miguelsolorio.symbols"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cpptools"
vscode "redhat.java"
vscode "rust-lang.rust-analyzer"
vscode "seatonjiang.gitmoji-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vue.volar"
vscode "wakatime.vscode-wakatime"
vscode "yoavbls.pretty-ts-errors"
